Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/hooks-reference_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: hooks-reference title: Hooks API Reference permalink: docs/hooks-reference.html prev: hooks-custom.html next: hooks-faq.html ---
ja: --- id: hooks-reference title: フック API リファレンス permalink: docs/hooks-reference.html prev: hooks-custom.html next: hooks-faq.html ---

source: *Hooks* are a new addition in React 16.8.
ja: *フック (hook)* は React 16.8 で追加された新機能です。

source: They let you use state and other React features without writing a class.
ja: state などの React の機能を、クラスを書かずに使えるようになります。

source: This page describes the APIs for the built-in Hooks in React.
ja: このページでは React 組み込みのフックについて説明します。

source: If you're new to Hooks, you might want to check out [the overview](/docs/hooks-overview.html) first.
ja: フックが初めての方は、先に[概要](/docs/hooks-overview.html)ページを確認してください。

source: You may also find useful information in the [frequently asked questions](/docs/hooks-faq.html) section.
ja: [よくある質問](/docs/hooks-faq.html)にも有用な情報が掲載されています。

source: - [Basic Hooks](#basic-hooks)
ja: - [基本のフック](#basic-hooks)

source: - [`useContext`](#usecontext) - [Additional Hooks](#additional-hooks)
ja: - [`useContext`](#usecontext) - [追加のフック](#additional-hooks)

source: ## Basic Hooks {#basic-hooks}
ja: ## 基本のフック {#basic-hooks}

source: Returns a stateful value, and a function to update it.
ja: ステートフルな値と、それを更新するための関数を返します。

source: During the initial render, the returned state (`state`) is the same as the value passed as the first argument (`initialState`).
ja: 初回のレンダー時に返される `state` は第 1 引数として渡された値 (`initialState`) と等しくなります。

source: The `setState` function is used to update the state.
ja: `setState` 関数は state を更新するために使用します。

source: It accepts a new state value and enqueues a re-render of the component.
ja: 新しい state の値を受け取り、コンポーネントの再レンダーをスケジューリングします。

source: During subsequent re-renders, the first value returned by `useState` will always be the most recent state after applying updates.
ja: 後続の再レンダー時には、`useState` から返される 1 番目の値は常に、更新を適用した後の最新版の state になります。

source: >Note > >React guarantees that `setState` function identity is stable and won't change on re-renders.
ja: > 補足 > > React は再レンダー間で `setState` 関数の同一性が保たれ、変化しないことを保証します。

source: This is why it's safe to omit from the `useEffect` or `useCallback` dependency list.
ja: 従って `useEffect` や `useCallback` の依存リストにはこの関数を含めないでも構いません。

source: #### Functional updates {#functional-updates}
ja: #### 関数型の更新 {#functional-updates}

source: If the new state is computed using the previous state, you can pass a function to `setState`.
ja: 新しい state が前の state に基づいて計算される場合は、`setState` に関数を渡すことができます。

source: The function will receive the previous value, and return an updated value.
ja: この関数は前回の state の値を受け取り、更新された値を返します。

source: Here's an example of a counter component that uses both forms of `setState`:
ja: 以下は、`setState` の両方の形式を用いたカウンタコンポーネントの例です。

source: The "+" and "-" buttons use the functional form, because the updated value is based on the previous value.
ja: "+" と "-" のボタンは、更新後の値が更新前の値に基づいて計算されるため、関数形式を使っています。

source: But the "Reset" button uses the normal form, because it always sets the count back to the initial value.
ja: "Reset" ボタンは常にカウントを初期値に戻すので、通常の形式を使っています。

source: If your update function returns the exact same value as the current state, the subsequent rerender will be skipped completely.
ja: この更新用関数が現在の state と全く同じ値を返す場合は、後続する再レンダーは完全にスキップされます。

source: > Note > > Unlike the `setState` method found in class components, `useState` does not automatically merge update objects.
ja: > 補足 > > クラスコンポーネントの `setState` メソッドとは異なり、`useState` は自動的な更新オブジェクトのマージを行いません。

source: You can replicate this behavior by combining the function updater form with object spread syntax: > > ```js > const [state, setState] = useState({}); > setState(prevState => { > // Object.assign would also work > return {...prevState, ...updatedValues}; > }); > ``` > > Another option is `useReducer`, which is more suited for managing state objects that contain multiple sub-values.
ja: この動作は関数型の更新形式をスプレッド構文と併用することで再現可能です： > > ```js > const [state, setState] = useState({}); > setState(prevState => { > // Object.assign would also work > return {...prevState, ...updatedValues}; > }); > ``` > > 別の選択肢としては `useReducer` があり、これは複数階層の値を含んだ state オブジェクトを管理する場合にはより適しています。

source: #### Lazy initial state {#lazy-initial-state}
ja: #### state の遅延初期化 {#lazy-initial-state}

source: The `initialState` argument is the state used during the initial render.
ja: `initialState` 引数は初回レンダー時に使われる state 値です。

source: In subsequent renders, it is disregarded.
ja: 後続のレンダー時にはその値は無視されます。

source: If the initial state is the result of an expensive computation, you may provide a function instead, which will be executed only on the initial render:
ja: もし初期 state が高価な計算をして求める値である場合は、代わりに関数を渡すことができます。この関数は初回のレンダー時にのみ実行されます。

source: #### Bailing out of a state update {#bailing-out-of-a-state-update}
ja: #### state 更新の回避 {#bailing-out-of-a-state-update}

source: If you update a State Hook to the same value as the current state, React will bail out without rendering the children or firing effects. (React uses the [`Object.is` comparison algorithm](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/is#Description).)
ja: 現在値と同じ値で更新を行った場合、React は子のレンダーや副作用の実行を回避して処理を終了します（React は [`Object.is` による比較アルゴリズム](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/is#Description)を使用します）。

source: Note that React may still need to render that specific component again before bailing out.
ja: 更新の回避が起きる前に React により該当のコンポーネント自体はレンダーされるかもしれない、ということに注意してください。

source: That shouldn't be a concern because React won't unnecessarily go "deeper" into the tree.
ja: ツリーのそれ以上「深く」にまで処理は及ばないためこれは問題ではないはずです。

source: If you're doing expensive calculations while rendering, you can optimize them with `useMemo`.
ja: もしレンダー中にコストの高い計算を行っている場合は `useMemo` を使った最適化が可能です。

source: Accepts a function that contains imperative, possibly effectful code.
ja: 副作用を有する可能性のある命令型のコードを受け付けます。

source: Mutations, subscriptions, timers, logging, and other side effects are not allowed inside the main body of a function component (referred to as React's _render phase_).
ja: DOM の書き換え、データの購読、タイマー、ロギング、あるいはその他の副作用を、関数コンポーネントの本体（React の*レンダーフェーズ*）で書くことはできません。

source: Doing so will lead to confusing bugs and inconsistencies in the UI.
ja: それを行うと UI にまつわるややこしいバグや非整合性を引き起こします。

source: Instead, use `useEffect`.
ja: 代わりに `useEffect` を使ってください。

source: The function passed to `useEffect` will run after the render is committed to the screen.
ja: `useEffect` に渡された関数はレンダーの結果が画面に反映された後に動作します。

source: Think of effects as an escape hatch from React's purely functional world into the imperative world.
ja: 副作用とは React の純粋に関数的な世界から命令型の世界への避難ハッチであると考えてください。

source: By default, effects run after every completed render, but you can choose to fire them [only when certain values have changed](#conditionally-firing-an-effect).
ja: デフォルトでは副作用関数はレンダーが終了した後に毎回動作しますが、[特定の値が変化した時のみ](#conditionally-firing-an-effect)動作させるようにすることもできます。

source: #### Cleaning up an effect {#cleaning-up-an-effect}
ja: #### エフェクトのクリーンアップ {#cleaning-up-an-effect}

source: Often, effects create resources that need to be cleaned up before the component leaves the screen, such as a subscription or timer ID.
ja: 副作用はしばしば、コンポーネントが画面から消える場合にクリーンアップする必要があるようなリソース（例えば購読やタイマー ID など）を作成します。

source: To do this, the function passed to `useEffect` may return a clean-up function.
ja: これを実現するために、`useEffect` に渡す関数はクリーンアップ用関数を返すことができます。

source: For example, to create a subscription:
ja: 例えば、データ購読を作成する場合は以下のようになります。

source: The clean-up function runs before the component is removed from the UI to prevent memory leaks.
ja: メモリリークを防止するため、コンポーネントが UI から削除される前にクリーンアップ関数が呼び出されます。

source: Additionally, if a component renders multiple times (as they typically do), the **previous effect is cleaned up before executing the next effect**.
ja: それに加えて、コンポーネントが複数回レンダーされる場合（大抵はそうですが）、**新しい副作用を実行する前に前回の副作用はクリーンアップされます**。

source: In our example, this means a new subscription is created on every update.
ja: この例では、更新が発生する度に新しい購読が作成される、ということです。

source: To avoid firing an effect on every update, refer to the next section.
ja: 毎回の更新で副作用が実行されるのを抑制するためには、後の節をご覧ください。

source: #### Timing of effects {#timing-of-effects}
ja: #### 副作用のタイミング {#timing-of-effects}

source: Unlike `componentDidMount` and `componentDidUpdate`, the function passed to `useEffect` fires **after** layout and paint, during a deferred event.
ja: `componentDidMount` や `componentDidUpdate` と異なり、`useEffect` に渡された関数はレイアウトと描画の**後で**遅延されたイベントとして実行されます。

source: This makes it suitable for the many common side effects, like setting up subscriptions and event handlers, because most types of work shouldn't block the browser from updating the screen.
ja: ほとんどの作業はブラウザによる画面への描画をブロックするべきではないため、購読やイベントハンドラのセットアップといったよくある副作用のほとんどにとって、この動作は適切です。

source: However, not all effects can be deferred.
ja: しかしすべての副作用が遅延できるわけではありません。

source: For example, a DOM mutation that is visible to the user must fire synchronously before the next paint so that the user does not perceive a visual inconsistency.
ja: 例えばユーザに見えるような DOM の改変は、ユーザが見た目の不整合性を感じずに済むよう、次回の描画が発生する前に同期的に発生する必要があります（この違いは概念的には受動的なイベントリスナと能動的なイベントリスナの違いに似ています）。

source: (The distinction is conceptually similar to passive versus active event listeners.) For these types of effects, React provides one additional Hook called [`useLayoutEffect`](#uselayouteffect).
ja: このようなタイプの副作用のため、React は [`useLayoutEffect`](#uselayouteffect) という別のフックを提供しています。

source: It has the same signature as `useEffect`, and only differs in when it is fired.
ja: これは `useEffect` と同じシグネチャを持っており、実行されるタイミングのみが異なります。

source: Although `useEffect` is deferred until after the browser has painted, it's guaranteed to fire before any new renders.
ja: `useEffect` はブラウザが描画を終えるまで遅延されますが、次回のレンダーが起こるより前に実行されることは保証されています。

source: React will always flush a previous render's effects before starting a new update.
ja: React は新しい更新を始める前に常にひとつ前のレンダーの副作用をクリーンアップします。

source: #### Conditionally firing an effect {#conditionally-firing-an-effect}
ja: #### 条件付きで副作用を実行する {#conditionally-firing-an-effect}

source: The default behavior for effects is to fire the effect after every completed render.
ja: デフォルトの動作では、副作用関数はレンダーの完了時に毎回実行されます。

source: That way an effect is always recreated if one of its dependencies changes.
ja: これにより、コンポーネントの依存配列のうちのいずれかが変化した場合に毎回副作用が再作成されます。

source: However, this may be overkill in some cases, like the subscription example from the previous section.
ja: しかし、上述のデータ購読の例でもそうですが、これは幾つかのケースではやりすぎです。

source: We don't need to create a new subscription on every update, only if the `source` prop has changed.
ja: 新しい購読を設定する必要があるのは毎回の更新ごとではなく、`source` プロパティが変化した場合のみです。

source: To implement this, pass a second argument to `useEffect` that is the array of values that the effect depends on.
ja: これを実装するためには、`useEffect` の第 2 引数として、この副作用が依存している値の配列を渡します。

source: Our updated example now looks like this:
ja: 変更後の例は以下のようになります。

source: Now the subscription will only be recreated when `props.source` changes.
ja: これで、データの購読は `props.source` が変更された場合にのみ再作成されるようになります。空の配列 `[]` を渡すと、この副作用がコンポーネント内のどの値にも依存していないということを React に伝えることになります。つまり副作用はマウント時に実行されアンマウント時にクリーンアップされますが、更新時には実行されないようになります。

source: >Note > >If you use this optimization, make sure the array includes **all values from the component scope (such as props and state) that change over time and that are used by the effect**.
ja: > 補足 > > この最適化を利用する場合、**時間の経過とともに変化し副作用によって利用される、コンポーネントスコープの値（props や state など）**がすべて配列に含まれていることを確認してください。

source: Otherwise, your code will reference stale values from previous renders.
ja: さもないとあなたのコードは以前のレンダー時の古い値を参照してしまうことになります。

source: Learn more about [how to deal with functions](/docs/hooks-faq.html#is-it-safe-to-omit-functions-from-the-list-of-dependencies) and what to do when the [array values change too often](/docs/hooks-faq.html#what-can-i-do-if-my-effect-dependencies-change-too-often).
ja: [関数の扱い方](/docs/hooks-faq.html#is-it-safe-to-omit-functions-from-the-list-of-dependencies)と[この配列の値が頻繁に変わる場合の対処法](/docs/hooks-faq.html#what-can-i-do-if-my-effect-dependencies-change-too-often)も参照してください。

source: > >If you want to run an effect and clean it up only once (on mount and unmount), you can pass an empty array (`[]`) as a second argument.
ja: > > もしも副作用とそのクリーンアップを 1 度だけ（マウント時とアンマウント時にのみ）実行したいという場合、空の配列 (`[]`) を第 2 引数として渡すことができます。

source: This tells React that your effect doesn't depend on *any* values from props or state, so it never needs to re-run.
ja: こうすることで、あなたの副作用は props や state の値の*いずれにも*依存していないため再実行する必要が一切ない、ということを React に伝えることができます。

source: This isn't handled as a special case -- it follows directly from how the dependencies array always works.
ja: これは特別なケースとして処理されているわけではなく、入力配列を普通に処理すればそうなるというだけの話です。

source: > >If you pass an empty array (`[]`), the props and state inside the effect will always have their initial values.
ja: > > 空の配列 (`[]`) を渡した場合、副作用内では props と state の値は常にその初期値のままになります。

source: While passing `[]` as the second argument is closer to the familiar `componentDidMount` and `componentWillUnmount` mental model, there are usually [better](/docs/hooks-faq.html#is-it-safe-to-omit-functions-from-the-list-of-dependencies) [solutions](/docs/hooks-faq.html#what-can-i-do-if-my-effect-dependencies-change-too-often) to avoid re-running effects too often.
ja: `[]` を渡すことはおなじみの `componentDidMount` と `componentWillUnmount` による概念と似ているように感じるでしょうが、通常は[こちら](/docs/hooks-faq.html#is-it-safe-to-omit-functions-from-the-list-of-dependencies)や[こちら](/docs/hooks-faq.html#what-can-i-do-if-my-effect-dependencies-change-too-often)のように、副作用を過度に再実行しないためのよりよい解決方法があります。

source: Also, don't forget that React defers running `useEffect` until after the browser has painted, so doing extra work is less of a problem.
ja: また `useEffect` はブラウザが描画し終えた後まで遅延されますので、追加の作業をしてもそれほど問題にならないということもお忘れなく。

source: > > >We recommend using the [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) rule as part of our [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) package.
ja: > > [`eslint-plugin-react-hooks`](https://www.npmjs.com/package/eslint-plugin-react-hooks#installation) パッケージの [`exhaustive-deps`](https://github.com/facebook/react/issues/14920) ルールを有効にすることをお勧めします。

source: It warns when dependencies are specified incorrectly and suggests a fix.
ja: これは依存の配列が正しく記述されていない場合に警告し、修正を提案します。

source: The array of dependencies is not passed as arguments to the effect function.
ja: 依存の配列は副作用関数に引数として渡されるわけではありません。

source: Conceptually, though, that's what they represent:
ja: しかし概念としては、この記法は副作用関数の引数が何なのかを表現しています。

source: every value referenced inside the effect function should also appear in the dependencies array.
ja: 副作用関数の内部で参照されているすべての値は入力の配列内にも現れるべきです。

source: In the future, a sufficiently advanced compiler could create this array automatically.
ja: 将来的には、コンパイラが発達すればこの配列を自動で作成することも可能であるはずです。

source: Accepts a context object (the value returned from `React.createContext`) and returns the current context value for that context.
ja: コンテクストオブジェクト（`React.createContext` からの戻り値）を受け取り、そのコンテクストの現在値を返します。

source: The current context value is determined by the `value` prop of the nearest `<MyContext.Provider>` above the calling component in the tree.
ja: コンテクストの現在値は、ツリー内でこのフックを呼んだコンポーネントの直近にある `<MyContext.Provider>` の `value` の値によって決定されます。

source: When the nearest `<MyContext.Provider>` above the component updates, this Hook will trigger a rerender with the latest context `value` passed to that `MyContext` provider.
ja: 直近の `<MyContext.Provider>` が更新された場合、このフックはその `MyContext` プロバイダに渡された最新の `value` の値を使って再レンダーを発生させます。

source: Even if an ancestor uses [`React.memo`](/docs/react-api.html#reactmemo) or [`shouldComponentUpdate`](/docs/react-component.html#shouldcomponentupdate), a rerender will still happen starting at the component itself using `useContext`.
ja: 祖先コンポーネントが [`React.memo`](/docs/react-api.html#reactmemo) や [`shouldComponentUpdate`](/docs/react-component.html#shouldcomponentupdate) を使っている場合でも、`useContext` を使っているコンポーネント自体から再レンダーが発生します。

source: Don't forget that the argument to `useContext` must be the *context object itself*:
ja: `useContext` に渡す引数は**コンテクストオブジェクト自体**であることを忘れないでください。

source: * **Correct:** `useContext(MyContext)`
ja: * **正しい：**`useContext(MyContext)`

source: * **Incorrect:** `useContext(MyContext.Consumer)`
ja: * **間違い：**`useContext(MyContext.Consumer)`

source: * **Incorrect:** `useContext(MyContext.Provider)`
ja: * **間違い：**`useContext(MyContext.Provider)`

source: A component calling `useContext` will always re-render when the context value changes.
ja: `useContext` を呼び出すコンポーネントはコンテクストの値が変化するたびに毎回再レンダーされます。

source: If re-rendering the component is expensive, you can [optimize it by using memoization](https://github.com/facebook/react/issues/15156#issuecomment-474590693).
ja: 再レンダーが高価である場合は[メモ化を使って最適化](https://github.com/facebook/react/issues/15156#issuecomment-474590693)が可能です。

source: >Tip > >If you're familiar with the context API before Hooks, `useContext(MyContext)` is equivalent to `static contextType = MyContext` in a class, or to `<MyContext.Consumer>`.
ja: > ヒント > > フック以前のコンテクスト API に馴染みがある場合は、`useContext(MyContext)` はクラスにおける `static contextType = MyContext`、あるいは `<MyContext.Consumer>` と同等のものであると考えることができます。

source: > >`useContext(MyContext)` only lets you *read* the context and subscribe to its changes.
ja: > > `useContext(MyContext)` は現在のコンテクストの値を**読み取り**、その変化を購読することしかできません。

source: You still need a `<MyContext.Provider>` above in the tree to *provide* the value for this context.
ja: コンテクストの値を**設定**するために、今後もツリーの上の階層で `<MyContext.Provider>` が必要です。

source: **Putting it together with Context.Provider** ```js{31-36} const themes = {
ja: **Context.Provider と組み合わせて使用する方法** ```js{31-36} const themes = {

source: ); } ``` This example is modified for hooks from a previous example in the [Context Advanced Guide](/docs/context.html), where you can find more information about when and how to use Context.
ja: ); } ``` この例は[コンテクストのガイド](/docs/context.html)をフック用に変更したものです。コンテクストをいつどのように使うべきかについては同記事を参照してください。

source: ## Additional Hooks {#additional-hooks}
ja: ## 追加のフック {#additional-hooks}

source: The following Hooks are either variants of the basic ones from the previous section, or only needed for specific edge cases.
ja: 以下のフックは前節で説明した基本のフックの変種であったり、特定の稀なケースでのみ必要となったりするものです。

source: Don't stress about learning them up front.
ja: 最初から無理に学ぼうとしなくて構いません。

source: An alternative to [`useState`](#usestate).
ja: [`useState`](#usestate) の代替品です。

source: Accepts a reducer of type `(state, action) => newState`, and returns the current state paired with a `dispatch` method. (If you're familiar with Redux, you already know how this works.)
ja: `(state, action) => newState` という型のリデューサ (reducer) を受け取り、現在の state を `dispatch` メソッドとペアにして返します（もし Redux に馴染みがあれば、これがどう動作するのかはご存じでしょう）。

source: `useReducer` is usually preferable to `useState` when you have complex state logic that involves multiple sub-values or when the next state depends on the previous one.
ja: 通常、`useReducer` が `useState` より好ましいのは、複数の値にまたがる複雑な state ロジックがある場合や、前の state に基づいて次の state を決める必要がある場合です。

source: `useReducer` also lets you optimize performance for components that trigger deep updates because [you can pass `dispatch` down instead of callbacks](/docs/hooks-faq.html#how-to-avoid-passing-callbacks-down).
ja: また、`useReducer` を使えば[コールバックの代わりに `dispatch` を下位コンポーネントに渡せる](/docs/hooks-faq.html#how-to-avoid-passing-callbacks-down)ようになるため、複数階層にまたがって更新を発生させるようなコンポーネントではパフォーマンスの最適化にもなります。

source: Here's the counter example from the [`useState`](#usestate) section, rewritten to use a reducer:
ja: 以下は [`useState`](#usestate) の部分で挙げたカウンタの例を、リデューサを使うよう書き換えたものです。

source: >Note > >React guarantees that `dispatch` function identity is stable and won't change on re-renders.
ja: > 補足 > > React は再レンダー間で `dispatch` 関数の同一性が保たれ、変化しないことを保証します。

source: #### Specifying the initial state {#specifying-the-initial-state}
ja: #### 初期 state の指定 {#specifying-the-initial-state}

source: There are two different ways to initialize `useReducer` state.
ja: `useReducer` の初期化の方法には 2 種類あります。

source: You may choose either one depending on the use case.
ja: ユースケースによりどちらかを選択してください。

source: The simplest way is to pass the initial state as a second argument:
ja: 最も単純な方法は第 2 引数として初期 state を渡すものです。

source: >Note > >React doesn’t use the `state = initialState` argument convention popularized by Redux.
ja: > 補足 > > React では、リデューサの引数で `state = initialState` のようにして初期値を示すという、Redux で普及した慣習を使用しません。

source: The initial value sometimes needs to depend on props and so is specified from the Hook call instead.
ja: 初期値は props に依存している可能性があるため、フックの呼び出し部分で指定します。

source: If you feel strongly about this, you can call `useReducer(reducer, undefined, reducer)` to emulate the Redux behavior, but it's not encouraged.
ja: 強いこだわりがある場合は `useReducer(reducer, undefined, reducer)` という呼び出し方で Redux の振る舞いを再現できますが、お勧めはしません。

source: #### Lazy initialization {#lazy-initialization}
ja: #### 遅延初期化 {#lazy-initialization}

source: You can also create the initial state lazily.
ja: 初期 state の作成を遅延させることもできます。

source: To do this, you can pass an `init` function as the third argument.
ja: そのためには `init` 関数を第 3 引数として渡してください。

source: The initial state will be set to `init(initialArg)`.
ja: 初期 state が `init(initialArg)` に設定されます。

source: It lets you extract the logic for calculating the initial state outside the reducer.
ja: これにより初期 state の計算をリデューサの外部に抽出することができます。

source: This is also handy for resetting the state later in response to an action:
ja: これはアクションに応じて state をリセットしたい場合にも便利です。

source: #### Bailing out of a dispatch {#bailing-out-of-a-dispatch}
ja: #### dispatch による更新の回避 {#bailing-out-of-a-dispatch}

source: If you return the same value from a Reducer Hook as the current state, React will bail out without rendering the children or firing effects. (React uses the [`Object.is` comparison algorithm](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/is#Description).)
ja: このフックから state の現在値として同じ値を返した場合、React は子のレンダーや副作用の実行を回避して処理を終了します（React は [`Object.is` による比較アルゴリズム](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/is#Description) を使用します）。

source: Returns a [memoized](https://en.wikipedia.org/wiki/Memoization) callback.
ja: [メモ化](https://en.wikipedia.org/wiki/Memoization)されたコールバックを返します。

source: Pass an inline callback and an array of dependencies.
ja: インラインのコールバックとそれが依存している値の配列を渡してください。

source: `useCallback` will return a memoized version of the callback that only changes if one of the dependencies has changed.
ja: `useCallback` はそのコールバックをメモ化したものを返し、その関数は依存配列の要素のいずれかが変化した場合にのみ変化します。

source: This is useful when passing callbacks to optimized child components that rely on reference equality to prevent unnecessary renders (e.g. `shouldComponentUpdate`).
ja: これは、不必要なレンダーを避けるために（例えば `shouldComponentUpdate` などを使って）参照の同一性を見るよう最適化されたコンポーネントにコールバックを渡す場合に便利です。

source: `useCallback(fn, deps)` is equivalent to `useMemo(() => fn, deps)`.
ja: `useCallback(fn, deps)` は `useMemo(() => fn, deps)` と等価です。

source: > Note > > The array of dependencies is not passed as arguments to the callback.
ja: > 補足 > > 依存する値の配列はコールバックに引数として渡されるわけではありません。

source: Conceptually, though, that's what they represent: every value referenced inside the callback should also appear in the dependencies array.
ja: しかし概念としては、この記法はコールバックの引数が何なのかを表現しています。コールバックの内部で参照されているすべての値は依存の配列内にも現れるべきです。
